##
## Tools
##
brew "atuin"                        # replacement for `ctrl-r`, better history search
brew "bat"                          # replacement for `cat`, adds syntax highlighting
brew "eza"                          # replacement for `ls`, just a bit easier to work with
brew "fd"                           # replacement for `find`, better/faster/stronger
brew "fzf"                          # fuzzy find all the things
brew "git-delta"                    # replacement for `diff`, adds syntax highlighting and better ui
brew "jq"                           # json parser
brew "ripgrep"                      # replacement for `grep`, better/faster/stronger
brew "rm-improved"                  # replacement for `rm`, becuse you can't go back from an `rm`
brew "xh"                           # curl alternative
brew "yq"                           # like `jq` but for yaml

##
## Managers & Runners
##
brew "antigen"                      # zsh plugin manager
brew "colima"                       # how i run containers these days
brew "composer"                     # php package manager
brew "docker"                       # just the cli, we'll use colima for heavy lifting
brew "docker-compose"               # if it's up, then it's up, then it's up...
brew "mas"                          # mac app store cli
brew "mise"                         # polyglot runtime manager (asdf rust clone)
brew "uv"                           # python package and project manager, yes another one

##
## Today's weapons of choice
##
brew "gh"                           # gitHub cli
brew "koekeishiya/formulae/skhd"    # hotkey-daemon for macOS
brew "koekeishiya/formulae/yabai"   # window manager
brew "neovim"                       # vim vs emacs?
brew "tmux"                         # i should really use this shouldn't I
cask "1password"                    # password manager
cask "google-chrome"                # browser
cask "iterm2"                       # terminal
cask "karabiner-elements"           # keyboard remapper
cask "mimestream"                   # email client
cask "notion-calendar"              # calendar
cask "raycast"                      # cmd-space, but also more
cask "shottr"                       # screenshot tool
cask "slack"                        # probably it's its own noun at this point
cask "spotify"                      # music
cask "tableplus"                    # database gui
cask "whatsapp"                     # so i can ignore all the group messages
mas "Things", id: 904280696         # todo list manager
