tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "thoughtbot/formulae"
tap "versent/taps"
brew "autojump"
brew "awscli"
brew "bat"
brew "composer"
brew "exa"
brew "fzf"
brew "git-delta"
brew "jq"
brew "md5sha1sum"
brew "node"
brew "php"
brew "pv"
brew "rcm"
brew "ripgrep"
brew "rmtrash"
brew "zsh-autosuggestions"
brew "d12frosted/emacs-plus/emacs-plus@26"
brew "versent/taps/saml2aws"
cask "docker"
