tap "homebrew/bundle"
tap "koekeishiya/formulae"
brew "antigen"
brew "asdf"
brew "bat"
brew "colima"
brew "exa"
brew "fd"
brew "fzf"
brew "jq"
brew "mas"
brew "neovim"
brew "poetry"
brew "pre-commit"
brew "ripgrep"
brew "yq"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "1password"
cask "alfred"
cask "cron"
cask "cursor"
cask "google-chrome"
cask "hammerspoon"
cask "karabiner-elements"
cask "kitty"
cask "mimestream"
cask "notion"
cask "slack"
cask "spotify"
cask "tableplus"
cask "visual-studio-code"
cask "whatsapp"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Things", id: 904280696
vscode "GitHub.copilot"
vscode "GitHub.github-vscode-theme"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.makefile-tools"
vscode "vscodevim.vim"
