tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "railwaycat/emacsmacport"

brew "antigen" # Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "awscli" # Official Amazon AWS command-line interface
brew "bash" # Bourne-Again SHell, a UNIX command interpreter
brew "bat" # Clone of cat(1) with syntax highlighting and Git integration
brew "colima" # Container runtimes on MacOS (and Linux) with minimal setup
brew "php" # General-purpose scripting language
brew "composer" # Dependency Manager for PHP
brew "coreutils" # GNU File, Shell, and Text utilities
brew "dockutil" # Tool for managing dock items
brew "exa" # Modern replacement for 'ls'
brew "fd" # Simple, fast and user-friendly alternative to find
brew "gh" # GitHub command-line tool
brew "git-delta" # Syntax-highlighting pager for git and diff output
brew "gnupg" # GNU Pretty Good Privacy (PGP) package
brew "jq" # Lightweight and flexible command-line JSON processor
brew "mas" # Mac App Store command-line interface
brew "neovim" # Ambitious Vim-fork focused on extensibility and agility
brew "node" # Platform built on V8 to build network applications
brew "ripgrep" # Search tool like grep and The Silver Searcher
brew "zsh" # UNIX shell (command interpreter)
brew "railwaycat/emacsmacport/emacs-mac", args: ["with-native-compilation", "with-natural-title-bar", "with-xwidgets"] # YAMAMOTO Mitsuharu's Mac port of GNU Emacs

cask "cron" # Calendar for professionals and teams
cask "font-meslo-lg-nerd-font" # Developer targeted fonts with a high number of glyphs
cask "iterm2" # Terminal emulator as alternative to Apple's Terminal app
cask "karabiner-elements" # Keyboard customizer
cask "mimestream" # Native app email client for Gmail
cask "notion" # App to write, plan, collaborate, and get organized
cask "qlmarkdown" # QuickLook generator for Markdown files
cask "raycast" # Control your tools with a few keystrokes
cask "tableplus" # Native GUI tool for relational databases

mas "Things", id: 904280696
